app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `email_address`, `oauth_token`, `updated_at`) VALUES ('2013-09-04 16:24:06', 'test@ss.com', 'CAAIHlkcbnzQBAKgJ4yalC5a1CRnhmyCby9T69BgZAeXgeKYjEcib7jxHKZAG4z98nbcRHvJsM4RnFkwL86GSZCVBZAwUrCqz5c4ff4knwHyDUacT3yRuIeZBDZCrIcWGXP3ecVJrbBynSlkRTAZCGmSaAYDfuJCLRmdfWisRiZB3FVRUj8upYN0D', '2013-09-04 16:24:06')
---
  def create
    val = FbGraph::User.me(params[:oauth_token]).fetch.raw_attributes
    # TODO issue is with the default column of the id from the facebook with the db column
    val.delete('id')

    @user = User.new(val)

    respond_to do |format|
      if @user.save